**Data Warehouse**

In [58]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [59]:
%%sql
sqlite:///../FP/CourseDataWarehouse.db

'Connected: @../FP/CourseDataWarehouse.db'

In [60]:
%%sql
SELECT * FROM import_teacher_info LIMIT 2;

 * sqlite:///../FP/CourseDataWarehouse.db
Done.

[('420', 'Nancy A.  Moriber', '15', '14', 'Nursing'),
 ('52', 'Anthony J.  DeCristofaro', '11', '4', 'Biology')]

In [61]:
%%sql

/* Dropping tables if they already exist */

DROP TABLE IF EXISTS DW_INSTRUCTOR;
DROP TABLE IF EXISTS DW_COURSE_OFFERING;
DROP TABLE IF EXISTS DW_COURSES;
DROP TABLE IF EXISTS DW_CATALOG_DESC;
DROP TABLE IF EXISTS DW_COURSE_MEETING;

 * sqlite:///../FP/CourseDataWarehouse.db
Done.
Done.
Done.
Done.
Done.

[]

**DML: Creating the Tables**

In [62]:
%%sql

/* Creating table DW_INSTRUCTOR based off of the ERD */

CREATE TABLE DW_INSTRUCTOR (
    instructor_id INTEGER PRIMARY KEY,
    primary_instructor TEXT NOT NULL
);

/* Creating table DW_CATALOG_DESC based off of the ERD */

CREATE TABLE DW_CATALOG_DESC (
    catalog_desc_id INTEGER PRIMARY KEY,
    program_name TEXT NOT NULL,
    course_title TEXT NOT NULL
);

/* Creating table DW_COURSES based off of the ERD */
CREATE TABLE DW_COURSES (
    course_offering_id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    term TEXT NOT NULL,
    catalog_id TEXT NOT NULL,
    section TEXT NOT NULL
);

/* Creating table DW_COURSE_OFFERING based off of the ERD */

CREATE TABLE DW_COURSE_OFFERING (
    CRN INTEGER NOT NULL,
    instructor_id INTEGER NOT NULL,
    cap INTEGER NOT NULL,
    act INTEGER NOT NULL,
    rem INTEGER NOT NULL,
    catalog_desc_id INTEGER,
    course_offering_id INTEGER NOT NULL,
    classes_taught INTEGER,
    distinct_preps INTEGER
);

/* Creating table DW_COURSE_MEETING based off of the ERD */

CREATE TABLE DW_COURSE_MEETING (
    course_offering_id INTEGER NOT NULL,
    location TEXT NOT NULL
);

 * sqlite:///../FP/CourseDataWarehouse.db
Done.
Done.
Done.
Done.
Done.

[]

**DDL: Inserting information into the Tables**

In [63]:
%%sql

/* Inserting the information into the DW_INSTRUCTOR table based off our Warehouse ERD */
INSERT INTO DW_INSTRUCTOR (instructor_id, primary_instructor) 
SELECT instructor_id, primary_instructor
FROM import_teacher_info;

/* Inserting the information into the DW_CATALOG_DESC table based off our Warehouse ERD */
INSERT INTO DW_CATALOG_DESC (catalog_desc_id, program_name, course_title)
SELECT catalog_desc_id, program_name, course_title
FROM CATALOG_DESC
;

/* Inserting the information into the DW_COURSES table based off our Warehouse ERD */
INSERT INTO DW_COURSES (course_offering_id, title, term, catalog_id, section)
SELECT course_offering_id, title, term, catalog_id, section
FROM COURSE_OFFERING
WHERE term = 'Summer2018' AND act > 10
OR term = 'Fall2018' AND act > 10
OR term = 'Spring2019' AND act > 10;
   
/* Inserting the information into the DW_COURSE_OFFERING table based off our Warehouse ERD */
INSERT INTO DW_COURSE_OFFERING (CRN, instructor_id, catalog_desc_id, course_offering_id, cap, act, rem, classes_taught, distinct_preps)
SELECT CRN, import_course_offering2.instructor_id, catalog_desc_id, course_offering_id, cap, act, rem, classes_taught, distinct_preps
FROM import_course_offering2
    JOIN import_teacher_info ON (import_teacher_info.instructor_id=import_course_offering2.instructor_id);
    
    
/* Inserting info into DW_COURSE_MEETING table based off ERD */
INSERT INTO DW_COURSE_MEETING (course_offering_id, location)
SELECT course_offering_id, location
FROM COURSE_MEETING;

 * sqlite:///../FP/CourseDataWarehouse.db
Done.
Done.
Done.
Done.
Done.

[]

In [64]:
%%sql
SELECT * FROM DW_COURSE_OFFERING LIMIT 10;

 * sqlite:///../FP/CourseDataWarehouse.db
Done.

[(58124, 10, 25, 28, -3, 275, 12655, 4, 3),
 (58125, 10, 25, 24, 1, 275, 12656, 4, 3),
 (58101, 9, 22, 23, -1, 313, 12657, 9, 4),
 (58102, 9, 20, 23, -3, 313, 12658, 9, 4),
 (58202, 9, 22, 22, 0, 313, 12659, 9, 4),
 (58103, 772, 22, 23, -1, 365, 12660, 5, 3),
 (58104, 14, 22, 24, -2, 365, 12661, 4, 2),
 (58203, 14, 22, 20, 2, 365, 12662, 4, 2),
 (58419, 18, 15, 14, 1, 92, 12664, 1, 1),
 (58219, 23, 20, 20, 0, 28, 12665, 5, 2)]

In [65]:
%%sql
SELECT * FROM DW_COURSE_MEETING LIMIT 10;

 * sqlite:///../FP/CourseDataWarehouse.db
Done.

[(1, 'DSB 105'),
 (1, 'DSB 105'),
 (1, 'DSB 105'),
 (1, 'DSB 105'),
 (1, 'DSB 105'),
 (1, 'DSB 105'),
 (1, 'DSB 105'),
 (1, 'DSB 105'),
 (1, 'DSB 105'),
 (1, 'DSB 105')]